[
    {
       "name":"LICENSE AGREEMENT",
       "markdown":"**MADE BY APES CERTIFICATION PROGRAM AGREEMENT**\n\n > This agreement (“Agreement”) is hereby entered into by and between YL IP Management, LLC (“Licensor”), an affiliate of Yuga Labs, Inc. (“Yuga Labs”), and the individual or entity identified in the application submitted to enter into this Agreement, which individual or entity is represented by wallet address **${OFFERER}** (such person or entity, the “Licensee”, and such wallet, the “Wallet”) in the MADE BY APES certification program (“MBA Program”).\n\n >",
       "injectedRules":[
          {
             "key":"OFFERER",
             "displayName":"Offerer",
             "regExp":"^[\u0020-\u007E -ÿ]+$",
             "positionIndex":0,
             "isRequired":[
                "proposal"
             ],
             "type":"text"
          }
       ]
    },
    {
       "name":"PRIMARY LICENSE",
       "markdown":"> > **1. Primary License.** Provided   that   Licensee   complies   with   all   of   the   terms   and   conditions   of   this   Agreement, including the Certification Requirements (defined below), Licensor hereby (a) issues to Licensee the Primary License   number   specified   in   Exhibit   A   (“Primary   License   #”),   and   (b)   grants   Licensee   a   limited,   revocable, worldwide, royalty-free, non-exclusive, non-sublicensable, non-transferable license (“Primary License”), during the Primary License Term (defined below), to use the MADE BY APES mark (“MBA Mark”), solely in tandem with   the   Primary   License   #,   in   the   form   depicted   on   Exhibit   A   (“ Primary   Certification   Mark”),   on   or   in connection with any of Licensee’s goods or services that: \n \n > > > i. meet the Certification Requirements; \n \n > > > ii. prominently feature  artwork associated with the  Bored Ape Yacht Club or Mutant Ape Yacht Club non-fungible token (“NFT”) identified by Licensee in its application for either a Primary License  (“Primary   Ape   Artwork”)   or  a   Product   License   (defined   below)   (“Product   Ape Artwork”); and \n \n > > > iii. were issued a Product License # (“Licensee Products”). \n \n"
    },
    {
       "name":"PRODUCT LICENSE",
       "markdown":"> > **2. Product License.**  Provided that Licensee holds an active and valid Primary License, Licensor hereby (a) issues to Licensee the Product License number(s) specified in the appendix to Exhibit B, which may be updated from time to time (each, a “Product License #”), and (b) grants Licensee a limited, revocable, worldwide, royalty-free, non- exclusive, non-sublicensable, non-transferable license (each, a “Product License”), during the Product License Term (defined below), to use Licensee’s Primary Certification Mark, solely in tandem with a Product License #, in the form depicted on the applicable appendix of Exhibit B (each, a “ Product Certification Mark”), on or in connection with the specific Licensee Products that: \n \n > > > i. meet the Certification Requirements; \n \n > > > ii. prominently feature the applicable Product Ape Artwork; and \n \n > > > iii. were issued the Product License # (i.e., not in connection with other goods or services). \n \n "
    },
    {
       "name":"PROHIBITIONS ANF RESTRICTIONS",
       "markdown":"> > **3. Prohibitions and Restrictions.** \n \n > > > a. Licensee may use the Primary Certification Mark and/or any Product Certification Marks (collectively, “Certification Marks”) only:  \n \n > > > > i. in the exact forms depicted on Exhibit A or an appendix of Exhibit B, as applicable, or otherwise in   strict   accordance   with   other   specifications   that   Licensor   may   from   time   to   time   provide including, but not limited to, those regarding its size, color, positioning, and any accompanying license number, language or symbols; \n \n > > > > ii. on or in connection with Licensee Products prominently featuring Primary Ape   Artwork or Product Ape Artwork, as applicable; and \n \n > > > > iii. for   the   sole   purpose   of   designating   that   Licensee   and/or   Licensee   Products   meet   the Certification Requirements. \n \n > > > Examples of unacceptable use include, but are not limited to, prominent use of the Certification Marks as the primary logo of or on any merchandise.  For the sake of clarity, the Primary Certification Mark mayvbe used on any Licensee Product, whereas a Product Certification Mark may be used only in connection with the particular Licensee Products for which the Product License # was issued.  \n \n > > > b. Licensee   shall   not,   directly   or   indirectly,     (i)   use   the   MBA   Mark   in   standalone   form   (i.e.,   without Licensee’s Primary License # or a Product License #), (ii) modify any Certification Mark, or combine any Certification   Mark   with   another   mark,   or   (iii)   use   any   Certification   Mark   in   any   manner   including, without limitation, in connection with any Licensee Products, that: (1) is not expressly authorized by this Agreement; (2) violates the rights (including but not limited to the intellectual property rights) of any third party, any Applicable Law (defined below), or this Agreement; (3) is profane, pornographic, vulgar, or offensive; (4) involves hate speech, endorses any form of hate, or harasses, abuses, insults, harms, defames,   slanders,   disparages,   intimidates,   threatens,   or   discriminates   against   others   based   on   gender, sexual   orientation,   religion,   ethnicity,   race,   age,   national   origin,   disability,   or   any   other   classes   or characteristics   as   may   be   protected   under   Applicable   Law;   (5)   spreads   false,   deceptive,   misleading, otherwise unsubstantiated or unfair information or material, or promotes any particular political agenda or message, in each case, whether commercial in nature or otherwise; (6) promotes any activities that may be, appear, or should reasonably be considered, unsafe or dangerous, including, without limitation, drugs prohibited by Applicable Law; (7) causes the Certification Mark to be used in any manner other than as a certification mark; (8) is likely to, or is intended to, reduce, diminish, or damage the goodwill, value, or reputation associated with the Certification Mark, Licensor or any other Licensor Party (defined below); (9)   indicates,   alleges,   or   otherwise   evidences,   that   Licensor   or   any   other   Licensor   Party   authorizes, approves, certifies, endorses, accredits, guarantees, or is otherwise responsible for any Licensee Product or Licensee’s use or exploitation of the Certification Mark; or (10) is intended or reasonably likely to do, result in, or cause any of the foregoing. \n \n > > > c. Notwithstanding anything in this Agreement, unless otherwise agreed to by the Parties under a different agreement   or   license,   Licensee   is   not   permitted   to   use,   is   not   granted   a   license   with   respect   to,   and otherwise does not have any rights, title, or interest in or to, any intellectual property owned or licensed by Licensor or any other Licensor Party, including, but not limited to, the MBA Mark or any trademark of Yuga Labs."
    },
    {
       "name":"CERTIFICATION REQUIREMENTS",
       "markdown":"> > **4. Certification   Requirements.**  In   order   to   be   eligible   to   use   the  Certification  Marks,   Licensee   represents, warrants, and covenants to Licensor that it meets and, at all times it uses the Certifications Marks in commerce, shall continue to meet, all of the following requirements (“Certification Requirements”): \n \n > > > a. Licensee currently owns the NFTs associated with, or has a license to use, the Primary Ape Artwork and any Product Ape Artwork;  \n \n > > > b. Licensee   and   all   Licensee   Products   comply   with   all  applicable   laws,   regulations,   codes,   and   rules including, without limitation, the Standards of Conduct and the FTC Endorsement Guides, and all laws, regulations,   codes   or   rules   regarding   packaging,   manufacturing   processes,   storage,   distribution, marketing, advertisement, sale of, and product safety with respect to, all Licensee Products, including any applicable   health   and   safety   standards   and   labor   and   employment   laws   for   manufacturing   operations. (collectively, “Applicable Laws”) \n \n > > > c. Licensee has used, or has a bona fide intent to use in commerce, within the Initial Term or Initial Product Term   (as   applicable)   a   Certification   Mark   in   connection   with   the   sale   of   Licensee   Products   that prominently feature Primary Ape Artwork or Product Ape Artwork; \n \n > > > d. Licensee Products do not violate any terms of this Agreement; \n \n > > > e. Licensee Products are not the subject of an unsatisfactory product rating from any applicable product or service rating company; \n \n > > > f. All information provided by Licensee in connection with the MADE BY APES certification process and this   Agreement,   including   any   application   submitted   by   Licensee   and   information   regarding   Licensee Products, is truthful, complete and accurate; \n \n > > > g. Licensee   has   retained   competent   and   reliable   evidence   to   substantiate   each   of   these   Certificatio Requirements."
    },
    {
       "name":"CONTROL",
       "markdown":"> > **5. Control.**  Licensor shall have absolute determination and control, in its sole discretion, over the design, redesign, modification,   authorized   or   unauthorized   use,   manner   and   degree   of   application,   manner   and   extent   of registration, maintenance, protection, enforcement, ownership, licensing, use, and termination of the Certification Marks.   Licensee shall immediately and at its sole cost and expense update, revise, or correct any usage of the Certification Marks that Licensor reasonably requests or regards as failing to comply with the requirements of this Agreement. \n \n"
    },
    {
       "name":"USAGE LIMITATIONS",
       "markdown":"> > **6. Usage Limitations.** \n \n > > > a. In the event that Licensor or any court or governmental entity determines that use of any Certification Mark may, in any particular manner or jurisdiction, violate any Applicable Law, be contrary to public policy, or may subject Licensor, or any of its subsidiaries, parent companies, Affiliates (including Yuga Labs), employees, directors, officers, managers, members, agents or other representatives (collectively, the   “Licensor   Parties”),   or   Licensee,   to   (i)   claims,   causes   of   action,   proceedings,   disputes,   or   other controversies,   of   any   nature,   (ii)   governmental   investigations,   inquiries,   inquisitions,   or   government process (including, but not limited to, any subpoena), or (iii) losses, damages, penalties or liabilities of any kind (the foregoing (i) through (iii), collectively, “Claims”), then in each case Licensee agrees, upon receipt of notice and request from Licensor, to immediately cease and desist from all use of any such Certification Mark.   The Licensor Parties shall not be liable to Licensee in any manner, and Licensee irrevocably waives any and all Claims, arising out of Licensor’s exercise of or Licensee’s obligations under this Section. \n \n > > > b. For purposes hereof, (i) “Affiliate” means, with respect to a Party, any Person that controls, is controlled by, or is under common control with such Party, (ii) “control” means possession of the direct or indirect power   to   direct   or   cause   the   direction   of   the   management   and   policies   of   a   Person,   whether   through ownership of voting securities, by contract, or otherwise, and “Person” means any natural person, entity, firm, corporation, or other organization."
    },
    {
       "name":"LiCENSOR OWNERSHIP",
       "markdown":"> > **7. Licensor Ownership of the Certification Mark.**   Licensee acknowledges that Licensor is the exclusive owner of all right, title, and interest in and to the MBA Mark and each of the Certification Marks and that nothing herein shall be construed to accord to Licensee any rights therein except as otherwise expressed in this Agreement.  Any goodwill   in   any   Certification   Mark   that   is   derived   from   Licensee’s   use   thereof   shall   inure   to   the   sole   and exclusive benefit of Licensor. \n \n > >Licensee will not at any time: (a) challenge Licensor’s right, title, or interest in the MBA Mark or Certification Marks or the validity or any registration thereof; (b) do or cause to be done or omit to do anything, the doing, causing, or omitting of which would contest or in any way impair or tend to impair the rights of Licensor in the MBA Mark or Certification Marks; (c) represent that it has any ownership in or rights (other than the usage rights expressly set forth in this Agreement) with respect to the MBA Mark or Certification Marks; or (d) claim, use, or apply to register or record in any jurisdiction any trademark, trade name, trade dress, corporate name, domain name, blockchain-based address, blockchain-based wallet or other blockchain-related identifier, email address, social media username, copyright, or design that is identical with, confusingly similar to, a colorable imitation of, derived from, based upon, or that includes the MBA Mark or any of the Certification Marks. \n \n"
    },
    {
       "name":"TERM",
       "markdown":"> > **8. Term.** \n \n > > > a. **Primary License Term.** Unless earlier terminated in accordance with this Agreement, the term of the Primary License shall continue for a period of six (6) months starting on the date that Licensee is issued a Primary License # (“Initial Term”).   If Licensee uses a Certification Mark in commerce in accordance with this Agreement during the Initial Term, and provides reasonable proof thereof to Licensor, then the term of the Primary License shall be extended for a period of one (1) year from the end date of the Initial Term (the “First Renewal Term”). If Licensee uses a Certification Mark in commerce in accordance with this Agreement during the First Renewal Term, and provides reasonable proof thereof to Licensor, then the term of the Primary License shall be extended for a period of two (2) years (the “ Second Renewal Term”, and together with the Initial Term, and the First Renewal Term, the “Primary License Term”). The Primary License Term may be further extended for successive periods in the same manner as the Second Renewal Term. \n \n > > > b. **Product Licese Term.** Unless   earlier   terminated   in   accordance   with   this   Agreement,   the   term   of   a Product License shall continue for a period of six (6) months starting on the date that Licensee is issued the applicable Product License # (“Initial Product Term”).  If Licensee uses a Product Certification Mark in commerce in accordance with this Agreement during the Initial Product Term, and provides reasonable proof thereof to Licensor, then the term of the Product License shall be extended for a period of one (1) year from the end date of the Initial Term (the “First Product Renewal Term”). If Licensee uses a Product Certification Mark in commerce in accordance with this Agreement during the First Product Renewal Term, and provides reasonable proof thereof to Licensor, then the term of the Product License shall be extended for a period of two (2) years (the “Second Product Renewal Term”, and together with the Initial Product Term, and the First Product Renewal Term, the “Product License Term”). The Product License Term may be further extended for successive periods in the same manner as the Second Product Renewal Term. For the avoidance of doubt, the term of a Product License shall be co-terminus with the Primary License. \n \n"
    },
    {
       "name":"TERMINATION",
       "markdown":"> > **9. Termination.** \n \n > > > a. Licensor shall be entitled to terminate this Agreement and/or revoke the Primary License or any Product License if (a) Licensee violates any provision of this Agreement or fails to use the Certification Marks in accordance with Licensor’s requirements, as may be amended or updated from time to time, and does not correct   such   violation   or   failure   within   ten   (10)   days’   written   notice   thereof   from   Licensor;   or   (b) Licensor elects to terminate the MBA Program as a whole for its own business reasons. \n \n > > > b.This   Agreement,   including   the   Primary   License   and   all   Product   Licenses   granted   thereunder,   shall immediately terminate upon Licensee’s loss of the rights to use the Primary Ape Artwork, including due to the transfer or sale of the Wallet or the NFT associated with the Primary Ape Artwork, to any non- Affiliate third party, whether authorized or unauthorized. \n \n > > > c. A Product License shall immediately terminate upon Licensee’s loss of the rights to use the applicable Product Ape Artwork, including due to the loss of the private keys associated with the NFT associated with the Product Ape Artwork, termination of a license to use the Product Ape Artwork, or transfer or sale   of   the   NFT   associated   with   the   Product   Ape   Artwork,   to   any   non-Affiliate   third   party,   whether authorized or unauthorized.  \n \n > > > d. Except as expressly set forth below, upon termination or expiration of this Agreement for any reason, the Primary License and any Product Licenses granted hereunder shall immediately terminate, Licensor may revoke   or   burn   any   non-fungible   token   recording   or   reflecting   this   Agreement,   and   Licensee   shall immediately discontinue all use of the Certification Marks.  If this Agreement, or any particular Product License, is terminated as a result of Licensee’s uncured breach of the terms hereof, Licensee shall not be entitled to any Sell-Off Period (defined below).   Conversely, if this Agreement is terminated or expires for any reason other than Licensee’s uncured breach of this Agreement, then Licensee shall be entitled to the Sell-off Period. Following termination, the Primary License # and Product License #s may be reissued to a new party. \n \n"
    },
    {
       "name":"SELL OFF PERIOD",
       "markdown":"> > **10. Sell-Off Period.** Upon termination or expiration of this Agreement or any Product License other than as a result of Licensee’s uncured breach of this Agreement, all rights herein licensed shall revert to Licensor without further notice, and Licensee shall have a non-exclusive thirty (30) day period (“ Sell-Off Period”) during which time Licensee shall be entitled to sell any inventory of Licensee Products featuring the Certification Mark in its stock. During   the   Sell-Off   Period,   Licensee   shall   not   produce   or   allow   the   production   of   any   additional   Licensee Products or other materials featuring any Certification Mark. \n \n"
    },
    {
       "name":"REPRESENTATIONS AND WARRANTIES",
       "markdown":"> > **11. Representations   and   Warranties.** Licensee   represents   and   warrants   that:   (a)   it   has   the   full   right,   power, capacity, and authority to enter this Agreement, and that it owns and controls the Wallet; (b) its exercise of the rights   granted   hereunder   including,   without   limitation,   use   of   any   material   in   connection   with   the   Licensee Products, will not violate the rights of any person, including any person’s intellectual property rights, right of publicity   or   privacy,   moral   rights,   or   cause   Licensor   or   any   other   Licensor   Part   to   become   subject   to   (or reasonably likely to become subject to) any Claim; (c) it has not engaged and will not directly or indirectly engage in any conduct or speech that would: (i) disparage, denigrate, portray in an unfavorable light, or reflect negatively on Licensor or any other Licensor Party, (ii) bring Licensee, Licensor or any other Licensor Party, or any of their respective Affiliates or brands or products, into public disrepute, contempt, or scandal, or (iii) injure the success or good will of Licensor or any other Licensor Party(or any of their Affiliates or brands or partnerships). \n \n"
    },
    {
       "name":"INDEMNITY",
       "markdown":"> > **12. Indemnity.** Licensee shall defend, indemnify, and hold the Licensor Parties from and against any and all Claims including, without limitation, settlement costs, and expenses (including, without limitation, reasonable outside attorneys’ fees), brought or asserted by a third-party against any of the Licensor Parties arising from or related to: (a) Licensee’s breach of this Agreement, and (b) the manufacture, advertising, promotion, use, marketing, or sale of Licensee Products. \n \n"
    },
    {
       "name":"CONSENT TO USE LICENSEE INFORMATION",
       "markdown":"> > **13. Consent to Use Licensee Information.**  Licensee authorizes the Licensor Parties to publish information about Licensee,   Licensee’s   business,   and   Licensee’s   use   of   the   Certification   Marks   for   the   purpose   of   indicating Licensee’s   participation   in   the   MBA   Program.     Without   limiting   the   generality   of   the   foregoing,   Licensee consents to the Licensor Parties’ use of Licensee’s name, logo, online profile information, and Ape Artwork: (a) on their websites, blogs, social media, and other Internet sources; (b) for use in recruiting additional Owners to apply to participate in the MBA Program; and (c) in press releases, news articles, advertisements, and other public statements   concerning   the   MBA   Program.   For   the   sake   of   clarity,   the   Licensor   Parties   shall   have   no   duty, responsibility,   or   obligation   to   keep   confidential   any   information   provided   by   Licensee   in   its   application   or otherwise in connection with this Agreement. \n \n"
    },
    {
       "name":"NO WARRANTY BY LICENSOR",
       "markdown":"> > **14. No Warranty by Licensor.** LICENSOR PROVIDES THE RIGHTS GRANTED HEREUNDER WITHOUT ANY   WARRANTY   OF   ANY   KIND.   LICENSOR   EXPRESSLY   DISCLAIMS   ANY   WARRANTY   OF MERCHANTABILITY,   FITNESS   FOR   A   PARTICULAR   PURPOSE,   OR   NONINFRINGEMENT.   UNDER NO CIRCUMSTANCES WILL LICENSOR OR ANY OTHER LICENSOR PARTY BE RESPONSIBLE FOR ANY CLAIMS, WHETHER DIRECT OR THIRD-PARTY, INCLUDING, BUT NOT LIMITED TO, THOSE ALLEGING,   PERSONAL   INJURY   OR   DEATH,   OR   ARISING   OUT   OF   OR   RESULTING   FROM LICENSEE’S   USE   OR   MISUSE   OF   ANY   CERTIFICATION   MARK,   THE   MANUFACTURE, ADVERTISING, PROMOTION, USE, MARKETING, AND SALE OF LICENSEE PRODUCTS, ANY USE OR   MISUSE   OF   ANY   LICENSEE,   PRODUCT,   OR   ANY   CONDUCT   OR   REPRESENTATIONS, WARRANTIES,   CERTIFICATIONS   OR   OTHER   ACTIONS   OR   OMISSIONS   OF   LICENSEE,   WHETHER ONLINE   OR   OFFLINE.   LICENSOR   MAKES   NO   REPRESENTATION,   WARRANTY,   GUARANTEE, CERTIFICATION OR OTHRWEISE ABOUT ANY LICENSEE PRODUCT OR ANY OTHER PRODUCTS BEARING   ANY   CERTIFICATION   MARK   AND   EXPRESSLY   DISCLAIMS   ANY   WARRANTY   OF FITNESS   FOR   A   PARTICULAR   PURPOSE   OF   THE   SAME.   LICENSOR   CANNOT   GUARANTEE   AND DOES NOT PROMISE ANY SPECIFIC RESULTS FROM USE OF ANY LICENSEE PRODUCT OR ANY PRODUCT(S) BEARING THE CERTIFICATION MARK. \n \n"
    },
    {
       "name":"LIMITATION OF LIABILITY",
       "markdown":"> > **15. Limitation of Liability.**  IN   NO   EVENT   SHALL   LICENSOR   OR   ANY   OTHER   LICENSOR   PARTY   BE LIABLE   TO LICENSEE OR ANY THIRD PARTY FOR ANY SPECIAL, INDIRECT, CONSEQUENTIAL, INCIDENTAL   OR   PUNITIVE   DAMAGES,   INCLUDING   LOST   PROFITS,   LOST   OPPORTUNITY,   LOST REVENUE,   LOSS   OF   GOOD   WILL,   OR   OTHERWISE,   ARISING   FROM,   RELATED   TO,   OR   IN CONNECTION WITH THIS AGREEMENT OR ANY ALLEGED BREACH OF ANY REPRESENTATION, WARRANTY OR OTHER PROVISION HEREIN, REGARDLESS OF THE LEGAL THEORY UPON WHICH SUCH CLAIMS ARE BASED AND EVEN IF LICENSOR HAS BEEN ADVISED OF THE POSSIBILITY THEREOF. TO THE EXTENT NOT PROHIBITED BY LAW, IN NO EVENT WILL LICENSOR’S AND ALL OTHER   LICENSOR   PARTIES’   AGGREGATE,   TOTAL   AND   CUMULATIVE   LIABILITY,   FOR   ALL CLAIMS OF ANY NATURE, WHETHER DIRECT OR INDIRECT, ARISING OUT OF, RELATED TO, OR IN   CONNECTION   WITH   THIS   AGREEMENT   OR   ANY   CERTIFICATION   MARK,   EXCEED   ONE HUNDRED UNITED STATES DOLLARS ($100.00). \n \n"
    },
    {
       "name":"RELATIONSHIP OF PARTIES",
       "markdown":"> > **16. Relationship of Parties.**   The   parties   are   independent   contractors.   No   agency,   partnership,   joint   venture, franchise, or employment is created between Licensor and Licensee as a result of this Agreement.  \n \n"
    },
    {
       "name":"ASSIGNEMENT THIRD PARTY BENEFICIARY",
       "markdown":"> > **17. Assignment; Third-Party Beneficiary.**  Yuga Labs is not a party, but shall be a third-party beneficiary, to this Agreement between Licensee and Licensor. Yuga Labs shall have the right to enforce this Agreement directly to the extent Yuga Labs may deem such enforcement necessary or advisable to protect its rights or the rights of Licensee or any lawful Owner. Licensee may not assign this Agreement without the prior written consent of Licensor. Licensor may assign this Agreement in its sole discretion. \n \n"
    },
    {
       "name":"DISPUTES GOVERNNG LAW",
       "markdown":"> > **18. Disputes; Governing Law and Choice of Forum.**  Except for any claim for injunctive relief arising out of Licensee’s breach of this Agreement, the Parties agree to arbitrate, in New York, New York, through JAMS, any and all disputes or claims arising out of or related to the validity, enforceability, interpretation, performance or breach of this Agreement, whether sounding in tort, contract, statutory violation or otherwise, or involving the construction or application or any of the terms, provisions, or conditions of this Agreement.  Any arbitration may be initiated by a written demand.   The arbitrator’s decision shall be final, binding, and conclusive.   The parties further agree that this Agreement is intended to be strictly construed to provide for arbitration as the sole and exclusive   means   for   resolution   of   all   disputes   hereunder   to   the   fullest   extent   permitted   by   law.     The   parties expressly waive any entitlement to have such controversies decided by a court or a jury. \n \n"
    },
    {
       "name":"SEVERABILITY",
       "markdown":"> > **19. Severability; Governing Law and Choice of Forum.**   If any provision or provisions of this Agreement shall be determined by a court of competent jurisdiction   to   be   illegal   or   unenforceable,   the   remaining   provisions   hereof   shall   be   deemed   severable   and enforceable in accordance with their terms. \n \n"
    },
    {
       "name":"ENTIRE AGREEMENT MODIFICATION",
       "markdown":"> > **20. Entire Agreement; Modification.**   This Agreement, including the exhibits and appendices hereto, represents and contains the entire agreement and understanding of the Licensor and Licensee with respect to the subject matter   of   this   Agreement,   and   it   supersedes   all   prior   oral   and   written   agreements   and   understandings   of Licensor and Licensee in this regard, all of which are merged herein. No representation, warranty, condition, understanding,   or   agreement   of   any   kind   with   respect   to   the   subject   matter   hereof   shall   be   relied   upon   by Licensee   unless   expressly   stated   herein.   This   Agreement   may   not   be   changed   or   any   provision   hereunder waived unless the change or waiver is in writing and signed by a proper representative of Licensor; provided, however, that if Licensee submits an application to receive a Product License and such application is approved by Licensor in its sole discretion, Licensor may add a new appendix to Exhibit B hereto to reflect the applicable Product Certification Mark.  No waiver of any instance of breach hereunder shall be construed as a waiver of any other instance of such breach. \n \n"
    },
    {
       "name":"COUNTERPARTS",
       "markdown":"> > **21. Counterparts.**   This Agreement may be executed in counterparts and electronically, including by click-through terms and blockchain-based signatures. Each of Licensor and Licensee represent and warrant that by effecting a transaction recorded on the blockchain to record this Agreement they acknowledge and agree to, and are bound by, the terms of this Agreement. \n \n"
    },
    {
       "name":"SURVIVAL",
       "markdown":"> > **22. Survival.**   All provisions that, by their nature, should survive the termination or expiration of this Agreement, shall continue in full force and effect beyond such termination or expiration. \n \n"
    },
    {
       "name":"SIGNATURE PAGE",
       "markdown":"> **IN WITNESS WHEREOF**  , Licensor and Licensee have caused this Agreement to executed, and agree to be bound by this Agreement, as of the last date in which Licensor or Licensee, as applicable, signs the blockchain-transaction to record this Agreement on the Ethereum blockchain as an image associated with a non-fungible token. \n \n > **LICENSOR** : \n \n > ${PROMISOR} \n \n > **LICENSEE** : \n \n > ${OFFERER} \n \n",
       "injectedRules":[
          {
             "key":"OFFERER",
             "displayName":"Offerer",
             "regExp":"^[\u0020-\u007E -ÿ]+$",
             "positionIndex":0,
             "isRequired":[
                "proposal"
             ],
             "type":"text"
          },
          {
             "key":"PROMISOR",
             "displayName":"Promisor",
             "regExp":"^[\u0020-\u007E -ÿ]+$",
             "positionIndex":1,
             "isRequired":[
                "counter-sign"
             ],
             "type":"text"
          }
       ]
    }
 ]